app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]

  def add_tmdb
    if params[:tmdb_movies] == nil
      flash[:notice] = "No movies were added"
    else
      selected_movies = (params[:tmdb_movies]).keys
      selected_movies.each do |k|
        Movie.create_from_tmdb(k)
---
INSERT INTO "movies" ("title", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Helen, Fred und Ted"], ["release_date", "2006-09-13 00:00:00.000000"], ["created_at", "2015-10-24 20:38:26.256876"], ["updated_at", "2015-10-24 20:38:26.256876"]]